#include "pce/hw/hdc.h"
#include "YBaseLib/BinaryReader.h"
#include "YBaseLib/BinaryWriter.h"
#include "YBaseLib/Log.h"
#include "YBaseLib/Memory.h"
#include "common/hdd_image.h"
#include "pce/bus.h"
#include "pce/hw/cdrom.h"
#include "pce/hw/ide_hdd.h"
#include "pce/interrupt_controller.h"
#include "pce/system.h"
#include <cstring>
Log_SetChannel(HW::HDC);

namespace HW {
DEFINE_OBJECT_TYPE_INFO(HDC);
BEGIN_OBJECT_PROPERTY_MAP(HDC)
END_OBJECT_PROPERTY_MAP()

HDC::HDC(const String& identifier, CHANNEL channel /* = CHANNEL_PRIMARY */,
         const ObjectTypeInfo* type_info /* = &s_type_info */)
  : BaseClass(identifier, type_info), m_channel(channel)
{
}

HDC::~HDC() = default;

bool HDC::Initialize(System* system, Bus* bus)
{
  if (!BaseClass::Initialize(system, bus))
    return false;

  m_interrupt_controller = m_system->GetComponentByType<InterruptController>();
  if (!m_interrupt_controller)
  {
    Log_ErrorPrintf("Failed to locate interrupt controller.");
    return false;
  }

  ConnectIOPorts(bus);

  // Flush the HDD images once a second, to ensure data isn't lost.
  m_image_flush_event = m_system->GetTimingManager()->CreateFrequencyEvent("HDD Image Flush", 1.0f,
                                                                           std::bind(&HDC::FlushImagesEvent, this));
  m_command_event = m_system->GetTimingManager()->CreateMicrosecondIntervalEvent(
    "HDC Command", 1, std::bind(&HDC::ExecutePendingCommand, this), false);
  return true;
}


        case ATA_CMD_RECALIBRATE + 0x0:
        case ATA_CMD_RECALIBRATE + 0x1:
        case ATA_CMD_RECALIBRATE + 0x2:
        case ATA_CMD_RECALIBRATE + 0x3:
        case ATA_CMD_RECALIBRATE + 0x4:
        case ATA_CMD_RECALIBRATE + 0x5:
        case ATA_CMD_RECALIBRATE + 0x6:
        case ATA_CMD_RECALIBRATE + 0x7:
        case ATA_CMD_RECALIBRATE + 0x8:
        case ATA_CMD_RECALIBRATE + 0x9:
        case ATA_CMD_RECALIBRATE + 0xA:
        case ATA_CMD_RECALIBRATE + 0xB:
        case ATA_CMD_RECALIBRATE + 0xC:
        case ATA_CMD_RECALIBRATE + 0xD:
        case ATA_CMD_RECALIBRATE + 0xE:
        case ATA_CMD_RECALIBRATE + 0xF:
          HandleATARecalibrate();
          break;

        case ATA_CMD_READ_PIO:
          HandleATATransferPIO(false, false, false);
          break;

        case ATA_CMD_READ_MULTIPLE_PIO:
          HandleATATransferPIO(false, false, true);
          break;

        case ATA_CMD_READ_PIO_EXT:
        case ATA_CMD_READ_PIO_NO_RETRY:
          HandleATATransferPIO(false, true, false);
          break;

        case ATA_CMD_READ_VERIFY:
          HandleATAReadVerifySectors(false, true);
          break;

        case ATA_CMD_READ_VERIFY_EXT:
          HandleATAReadVerifySectors(true, false);
          break;

        case ATA_CMD_WRITE_PIO:
        case ATA_CMD_WRITE_PIO_NO_RETRY:
          HandleATATransferPIO(true, false, false);
          break;

        case ATA_CMD_WRITE_MULTIPLE_PIO:
          HandleATATransferPIO(true, false, true);
          break;

        case ATA_CMD_WRITE_PIO_EXT:
          HandleATATransferPIO(true, true, false);
          break;

        case ATA_CMD_SET_MULTIPLE_MODE:
          HandleATASetMultipleMode();
          break;

        case ATA_CMD_EXECUTE_DRIVE_DIAGNOSTIC:
          HandleATAExecuteDriveDiagnostic();
          break;

        case ATA_CMD_INITIALIZE_DRIVE_PARAMETERS:
          HandleATAInitializeDriveParameters();
          break;

        case ATA_CMD_SET_FEATURES:
          HandleATASetFeatures();
          break;

        default:
        {
          // Unknown command - abort is correct?
          Log_ErrorPrintf("Unknown ATA command 0x%02X", ZeroExtend32(command));
          AbortCommand();
        }
        break;
      }
    }
    break;

    case DRIVE_TYPE_ATAPI:
    {
      switch (command)
      {
        case ATA_CMD_IDENTIFY:
          HandleATAIdentify();
          break;

        case ATA_CMD_IDENTIFY_PACKET:
          HandleATAPIIdentify();
          break;

        case ATA_CMD_DEVICE_RESET:
          HandleATADeviceReset();
          break;

        case ATAPI_CMD_PACKET:
          HandleATAPIPacket();
          break;

        default:
        {
          // Unknown command - abort is correct?
          Log_ErrorPrintf("Unknown ATAPI command 0x%02X", ZeroExtend32(command));
          AbortCommand();
        }
        break;
      }
    }
    break;

    default:
    {
      Log_ErrorPrintf("Unknown drive type");
      AbortCommand();
    }
    break;
  }
}

#pragma pack(push, 1)
struct ATA_IDENTIFY_RESPONSE
{
  uint16 flags;                        // 0
  uint16 cylinders;                    // 1
  uint16 unused_0;                     // 2
  uint16 heads;                        // 3
  uint16 unformatted_bytes_per_track;  // 4
  uint16 unformatted_bytes_per_sector; // 5
  uint16 sectors_per_track;            // 6
  uint16 unused_1[3];                  // 7-9
  char serial_number[20];              // 10-19
  uint16 buffer_type;                  // 20
  uint16 buffer_size;                  // 21 - in 512kb increments
  uint16 ecc_bytes;                    // 22 - should be 4
  char firmware_revision[8];           // 23-26
  char model[40];                      // 27-46
  uint16 readwrite_multiple_supported; // 47
  uint16 dword_io_supported;           // 48
  uint16 support;                      // 49
  uint16 unused_2;                     // 50
  uint16 pio_timing_mode;              // 51
  uint16 dma_timing_mode;              // 52
  uint16 user_fields_valid;            // 53
  uint16 user_cylinders;               // 54
  uint16 user_heads;                   // 55
  uint16 user_sectors_per_track;       // 56
  uint32 user_total_sectors;           // 57-58
  uint16 multiple_sector_setting;      // 59
  uint32 lba_sectors;                  // 60-61
  uint16 singleword_dma_modes;         // 62
  uint16 multiword_dma_modes;          // 63
  uint16 pio_modes_supported;          // 64
  uint16 pio_cycle_time[4];            // 65-68
  uint16 unused_4[11];                 // 69-79
  uint16 word_80;                      // 80
  uint16 minor_version_number;         // 81
  uint16 word_82;                      // 82
  uint16 supports_lba48;               // 83 set (1 << 10) here
  uint16 word_84;                      // 84
  uint16 word_85;                      // 85
  uint16 word_86;                      // 86
  uint16 word_87;                      // 87
  uint16 word_88;                      // 88
  uint16 word_89;                      // 89
  uint16 word_90;                      // 90
  uint16 word_91;                      // 91
  uint16 word_92;                      // 92
  uint16 word_93;                      // 93
  uint16 unused_5[6];                  // 94-99
  uint64 lba48_sectors;                // 100-103
  uint16 unused_6[152];                // 104-255
};
static_assert(sizeof(ATA_IDENTIFY_RESPONSE) == HDC::SECTOR_SIZE, "ATA identify response is one sector in length");
#pragma pack(pop)

static void PutIdentifyString(char* buffer, uint32 buffer_size, const char* str)
{
  Assert(buffer_size <= 40);
  char temp_buffer[40 + 1];
  size_t len = std::strlen(str);
  Y_strncpy(temp_buffer, countof(temp_buffer), str);
  for (size_t i = len; i < countof(temp_buffer); i++)
    temp_buffer[i] = ' ';

  uint16* word_buffer = reinterpret_cast<uint16*>(buffer);
  for (uint32 i = 0; i < (buffer_size / sizeof(uint16)); i++)
    word_buffer[i] = ZeroExtend16(temp_buffer[i * 2] << 8) | ZeroExtend16(temp_buffer[i * 2 + 1]);
}

void HDC::HandleATAIdentify()
{
  Log_DevPrintf("ATA identify drive %u", ZeroExtend32(GetCurrentDriveIndex()));
